Revit 2026 API

# CameraInfoNearDistance Property

---

Distance from eye point to near plane of view frustum along the view direction.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double NearDistance { get; }
```
```vb
Public ReadOnly Property NearDistance As Double
	Get
```
```cpp
public:
property double NearDistance {
	double get ();
}
```
```fsharp
member NearDistance : float with get
```

#### Property Value

Double

This property together with FarDistance determines the depth restrictions of a view frustum.

#### Reference

CameraInfo Class

Autodesk.Revit.DB Namespace